tests/performance/load-test.yml
# Artillery Load Testing Configuration for AttendanceMS
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
  payload:
    path: "./test-data.csv"
    fields:
      - "email"
      - "password"
  defaults:
    headers:
      'User-Agent': 'Artillery Load Test'

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"

  - name: "Login Flow"
    weight: 30
    flow:
      - get:
          url: "/login"
      - post:
          url: "/login"
          form:
            email: "{{ email }}"
            password: "{{ password }}"
          expect:
            - statusCode: [200, 302]

  - name: "Dashboard Access"
    weight: 25
    flow:
      - get:
          url: "/login"
      - post:
          url: "/login"
          form:
            email: "mjsfutane21@gmail.com"
            password: "abc@1234"
          capture:
            - header: "set-cookie"
              as: "sessionCookie"
      - get:
          url: "/dashboard"
          headers:
            Cookie: "{{ sessionCookie }}"
          expect:
            - statusCode: 200

  - name: "API Endpoints"
    weight: 20
    flow:
      - get:
          url: "/api/status"
          expect:
            - statusCode: 200
      - get:
          url: "/api/classes"
          expect:
            - statusCode: [200, 401]

  - name: "Static Assets"
    weight: 15
    flow:
      - get:
          url: "/css/style.css"
          expect:
            - statusCode: 200
      - get:
          url: "/js/main.js"
          expect:
            - statusCode: 200